{"title":"32527060.mp3","language":"en","model":"medium","provider":"local","segments":[{"start":0.031,"end":16.028,"text":" I'm going to show you guys one of the easiest day trading strategies that you can use to make money in these markets. This is the most beginner friendly trading strategy and it appears every single day, requires no daily bias and can make you money tomorrow."},{"start":16.028,"end":39.029,"text":" The very first thing you want to do is mark out the most obvious connected price swing before 9.30am. Then if we play it through, you wait for either side of this to be taken out. You can see here we take out the high here. Remember, I'm waiting for the most obvious price swing to be taken out. Then you wait for a change in the state of delivery or fair value gap."},{"start":39.029,"end":66.907,"text":" When we close below these up close candles I want to take a short, targeting the low of the range. You can see with this candle now we closed below the 3 up close candles, you would put an entry tool here, you would go short with your stop loss above 75% of this wick, targeting a couple of points below that low. You can quite clearly see here that we tag into a position and then reach down and trade through the other side of liquidity."},{"start":66.907,"end":80.339,"text":" Again, this is the most beginner-friendly way to start entering the markets and start getting onside with price. If you want to be sent over a free guide where I explain this properly, comment 930 and I'll send it over to you in the DMs."}],"full_text":"I'm going to show you guys one of the easiest day trading strategies that you can use to make money in these markets. This is the most beginner friendly trading strategy and it appears every single day, requires no daily bias and can make you money tomorrow. The very first thing you want to do is mark out the most obvious connected price swing before 9.30am. Then if we play it through, you wait for either side of this to be taken out. You can see here we take out the high here. Remember, I'm waiting for the most obvious price swing to be taken out. Then you wait for a change in the state of delivery or fair value gap. When we close below these up close candles I want to take a short, targeting the low of the range. You can see with this candle now we closed below the 3 up close candles, you would put an entry tool here, you would go short with your stop loss above 75% of this wick, targeting a couple of points below that low. You can quite clearly see here that we tag into a position and then reach down and trade through the other side of liquidity. Again, this is the most beginner-friendly way to start entering the markets and start getting onside with price. If you want to be sent over a free guide where I explain this properly, comment 930 and I'll send it over to you in the DMs.","word_count":253,"segment_count":4,"transcription_time":97.95}